Examinator/src/InformationRegisters/СессииВебКабинетаСУ/СессииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СессииВебКабинетаСУ</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияСессии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/СессииВебКабинетаСУ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Получание данных сессии

Функция ДанныеСессии(Знач ИдентификаторСессии) Экспорт
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(ИдентификаторСессии);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессииВебКабинетаСУ.Пользователь,
		|	СессииВебКабинетаСУ.ИдентификаторКлиента,
		|	СессииВебКабинетаСУ.Закрыта,
		|	СессииВебКабинетаСУ.СохраняемоеЗначениеПароля,
		|	СессииВебКабинетаСУ.Идентификатор,
		|	СессииВебКабинетаСУ.Права,
		|	СессииВебКабинетаСУ.ДатаПоследнейАктивности
		|ИЗ
		|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
		|ГДЕ
		|	СессииВебКабинетаСУ.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	ДанныеСессии = Запрос.Выполнить().Выбрать();

	Если ДанныеСессии.Следующий() Тогда
		Возврат ДанныеСессии;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ДанныеСессииЗапроса(Запрос, ДанныеСессии, КодОшибки, ПроверятьКлюч = Истина, Знач ПраваДляПроверки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ИдентификаторСессии = Запрос.ПараметрыЗапроса.Получить("session");
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		КодОшибки = "noUserSession";
		Возврат;
	КонецЕсли;	
	
	ДанныеСессии = РегистрыСведений.СессииВебКабинетаСУ.ДанныеСессии(ИдентификаторСессии);
	
	Если ДанныеСессии = Неопределено Тогда
		КодОшибки = "noUserSession";
		Возврат;
	КонецЕсли;
	
	Если ДанныеСессии.Закрыта Тогда
		КодОшибки = "userSessionClose";
		Возврат;
	КонецЕсли;	

	Если ПроверятьКлюч Тогда
	
		КлючКлиента = Запрос.ПараметрыЗапроса.Получить("key");
		
		Если КлючКлиента = Неопределено Тогда
			КодОшибки = "noKeySession";
			Возврат;
		КонецЕсли;
		
		ВерсияКабинета = ВебКабинетСУ.ВерсияAPI();
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
		Хеширование.Добавить(ВерсияКабинета + ДанныеСессии.СохраняемоеЗначениеПароля + ДанныеСессии.ИдентификаторКлиента + ИдентификаторСессии);
		
		КлючСессии = Base64Строка(Хеширование.ХешСумма);	
		
		Если КлючСессии <> КлючКлиента Тогда
			КодОшибки = "errorKeySession";
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПраваДляПроверки <> Неопределено Тогда
		
		Права = ДанныеСессии.Права.Получить();
		ЕстьПраво = Ложь;
		
		Если ТипЗнч(ПраваДляПроверки) = Тип("Массив") Тогда
			МассивПравДляПроверки = ПраваДляПроверки;
		Иначе
			МассивПравДляПроверки = Новый Массив;
			МассивПравДляПроверки.Добавить(ПраваДляПроверки);
		КонецЕсли;
		
		Для каждого ПравоДляПроверки Из МассивПравДляПроверки Цикл
		
			Если Права.Свойство(ПравоДляПроверки) И Права[ПравоДляПроверки] Тогда
				ЕстьПраво = Истина;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ ЕстьПраво Тогда
			КодОшибки = "noPermissions";
			Возврат;			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция АктивныеПользователи(Пользователи = Неопределено, ВернутьТаблицу = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяДата = ТекущаяДатаСеанса();	
	
	
	ЧастотаСбораСтатистики = 60*5;	
	ПубликацияРедакции30 = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге(Перечисления.РедакцииВебКабинетаСУ.Редакция30);		
	Если ЗначениеЗаполнено(ПубликацияРедакции30) Тогда
		ЧастотаСбораСтатистики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПубликацияРедакции30, "ЧастотаСбораСтатистики");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессииВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.СессииВебКабинетаСУ КАК СессииВебКабинетаСУ
		|ГДЕ
		|	&ОтборПользователей
		|	И РАЗНОСТЬДАТ(СессииВебКабинетаСУ.ДатаПоследнейАктивности, &ТекущаяДата, СЕКУНДА) < &ЧастотаСбораСтатистики
		|	И СессииВебКабинетаСУ.ДатаПоследнейАктивности <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СессииВебКабинетаСУ.Закрыта = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЧастотаСбораСтатистики", ЧастотаСбораСтатистики);
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	Если Пользователи <> Неопределено Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "СессииВебКабинетаСУ.Пользователь В(&Пользователи)");
		Запрос.УстановитьПараметр("Пользователи", Пользователи);	
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ИСТИНА");		
	КонецЕсли;
	
	ТаблицаОнлайн = Запрос.Выполнить().Выгрузить();
	
	Если ВернутьТаблицу Тогда
		Возврат  ТаблицаОнлайн;
	Иначе		
		Возврат ТаблицаОнлайн.ВыгрузитьКолонку("Пользователь");
	КонецЕсли;
	
КонецФункции

// Запись данных сессий

Функция СоздатьСессию(Пользователь, ИдентификаторКлиента, СохраняемоеЗначениеПароля, Права, ТипАутентификации) Экспорт
	
	ИдентификаторНовойСессии = Новый УникальныйИдентификатор();
	ДатаНачалаСессии = ТекущаяДатаСеанса();	
	
	НаборЗаписей = РегистрыСведений.СессииВебКабинетаСУ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторНовойСессии);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Идентификатор             = ИдентификаторНовойСессии;
	НоваяЗапись.Пользователь              = Пользователь;
	НоваяЗапись.ИдентификаторКлиента      = ИдентификаторКлиента;
	НоваяЗапись.ДатаНачалаСессии          = ДатаНачалаСессии;
	НоваяЗапись.СохраняемоеЗначениеПароля = СохраняемоеЗначениеПароля;
	НоваяЗапись.Права                     = Новый ХранилищеЗначения(Права);
	НоваяЗапись.Тип                       = ТипАутентификации;
	НоваяЗапись.ДатаПоследнейАктивности   = ДатаНачалаСессии;

	НаборЗаписей.Записать();	
	
	Возврат Новый Структура("ДатаНачалаСессии, ИдентификаторНовойСессии", ДатаНачалаСессии, ИдентификаторНовойСессии);
	
КонецФункции

Процедура ЗакрытьСессию(Знач ИдентификаторСессии) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.СессииВебКабинетаСУ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторСессии);
	
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
	
		Запись = НаборЗаписей.Получить(0);
		Запись.Закрыта = Истина;
		Запись.ДатаЗакрытияСессии = ТекущаяДата;
		Запись.ДатаПоследнейАктивности = ТекущаяДата;
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбновитьПрава(Знач ИдентификаторСессии, Права) Экспорт
	
	НаборЗаписей = РегистрыСведений.СессииВебКабинетаСУ.СоздатьНаборЗаписей();
			
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторСессии);
	
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
	
		Запись = НаборЗаписей.Получить(0);
		
		Если ТипЗнч(Права) = Тип("ХранилищеЗначения") Тогда
			Запись.Права = Права;
		Иначе
			Запись.Права = Новый ХранилищеЗначения(Права);
		КонецЕсли;
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьДатуАктивности(Знач ИдентификаторСессии) Экспорт
	
	НаборЗаписей = РегистрыСведений.СессииВебКабинетаСУ.СоздатьНаборЗаписей();
			
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторСессии);
	
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
	
		Запись = НаборЗаписей.Получить(0);
		
		Запись.ДатаПоследнейАктивности = ТекущаяДатаСеанса();
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
